In [1]:
import pandas as pd

import Clean_data as cld
import Transform_Data as tfd
import Visualize_Data as vld

In [2]:
city_sales_price = cld.get_city_sales_price()
state_sales_price = cld.get_state_sales_price()
city_days = cld.get_city_days()
state_days = cld.get_state_days()

In [3]:
# city_sales_price.to_csv('Datasets/House Price/City_Sales_Price_Cleaned.csv',index=False)
# state_sales_price.to_csv('Datasets/House Price/State_Sales_Price_Cleaned.csv',index=False)
# city_days.to_csv('Datasets/House Price/City_Days_Cleaned.csv',index=False)
# state_days.to_csv('Datasets/House Price/State_Days_Cleaned.csv',index=False)

In [4]:
city_sales_price['State'].value_counts().head(5)

California    4065
Florida       2591
Texas         1602
New Jersey    1449
Illinois      1313
Name: State, dtype: int64

In [5]:
city_days['State'].value_counts().head(5)

CA    1433
FL    1319
TX     814
MI     557
NJ     466
Name: State, dtype: int64

The bulk of my data is centered around the predominantly 'top-tier' locations, like California.

In [6]:
city_days_mean = city_days.groupby('State')['value'].mean().sort_values(ascending = False)

In [7]:
city_sales_price_mean = city_sales_price.groupby('State')['value'].mean().sort_values(ascending = False)

In [8]:
city_days_mean.head(10)

State
NY    145.800860
NJ    132.361588
AK    121.911765
IL    121.540943
CT    120.500000
ND    115.466667
MD    114.979885
NM    114.011364
AL    113.348039
SC    112.756410
Name: value, dtype: float64

In [9]:
city_sales_price_mean.head(10)

State
California              474234.612546
District of Columbia    462416.666667
Hawaii                  458380.124224
Massachusetts           356969.288703
New York                331113.535912
New Jersey              326177.225673
Washington              319728.265107
Virginia                303728.233971
Colorado                302351.750973
Rhode Island            296996.000000
Name: value, dtype: float64

California, despite ranking highest for cost per home, is not top tier for days to sell.

I will create a list with a score based on value divided by days on market in order to rate how high-priority the area is.

In [10]:
def convert_to_full(df):
    df['State'] = df['State'].str.replace('NY', 'New York')
    df['State'] = df['State'].str.replace('NJ', 'New Jersey')
    df['State'] = df['State'].str.replace('AK', 'Arkansas')
    df['State'] = df['State'].str.replace('IL', 'Illinois')
    df['State'] = df['State'].str.replace('CT', 'Connecticut')
    df['State'] = df['State'].str.replace('ND', 'North Dakota')
    df['State'] = df['State'].str.replace('MD', 'Maryland')
    df['State'] = df['State'].str.replace('NM', 'New Mexico')
    df['State'] = df['State'].str.replace('AL', 'Alabama')
    df['State'] = df['State'].str.replace('SC', 'South Carolina')
    df['State'] = df['State'].str.replace('LA', 'Louisiana')
    df['State'] = df['State'].str.replace('DE', 'Delaware')
    df['State'] = df['State'].str.replace('PA', 'Pennsylvania')
    df['State'] = df['State'].str.replace('NC', 'North Carolina')
    df['State'] = df['State'].str.replace('FL', 'Florida')
    df['State'] = df['State'].str.replace('MS', 'Mississippi')
    df['State'] = df['State'].str.replace('IA', 'Iowa')
    df['State'] = df['State'].str.replace('MT', 'Montana')
    df['State'] = df['State'].str.replace('VA', 'Virginia')
    df['State'] = df['State'].str.replace('MI', 'Michigan')
    df['State'] = df['State'].str.replace('OK', 'Oklahoma')
    df['State'] = df['State'].str.replace('GA', 'Georgia')
    df['State'] = df['State'].str.replace('RI', 'Rhode Island')
    df['State'] = df['State'].str.replace('OR', 'Oregon')
    df['State'] = df['State'].str.replace('MN', 'Minnesota')
    df['State'] = df['State'].str.replace('TN', 'Tennessee')
    df['State'] = df['State'].str.replace('NV', 'Nevada')
    df['State'] = df['State'].str.replace('AR', 'Arkansas')
    df['State'] = df['State'].str.replace('WI', 'Wisconsin')
    df['State'] = df['State'].str.replace('NE', 'Nebraska')
    df['State'] = df['State'].str.replace('OH', 'Ohio')
    df['State'] = df['State'].str.replace('KY', 'Kentucky')
    df['State'] = df['State'].str.replace('DC', 'District of Colombia')
    df['State'] = df['State'].str.replace('ID', 'Idaho')
    df['State'] = df['State'].str.replace('TX', 'Texas')
    df['State'] = df['State'].str.replace('IN', 'Indiana')
    df['State'] = df['State'].str.replace('MA', 'Massachusetts')
    df['State'] = df['State'].str.replace('HI', 'Hawaii')
    df['State'] = df['State'].str.replace('MO', 'Missouri')
    df['State'] = df['State'].str.replace('WV', 'West Virginia')
    df['State'] = df['State'].str.replace('WA', 'Washington')
    df['State'] = df['State'].str.replace('KS', 'Kansas')
    df['State'] = df['State'].str.replace('SD', 'South Dakota')
    df['State'] = df['State'].str.replace('NH', 'New Hampshire')
    df['State'] = df['State'].str.replace('AZ', 'Arizona')
    df['State'] = df['State'].str.replace('ME', 'Maine')
    df['State'] = df['State'].str.replace('CA', 'California')
    df['State'] = df['State'].str.replace('WY', 'Wyoming')
    df['State'] = df['State'].str.replace('CO', 'Colorado')
    df['State'] = df['State'].str.replace('VT', 'Vermont')
    df['State'] = df['State'].str.replace('UT', 'Utah')
    return df

In [11]:
state_days = convert_to_full(state_days)

In [12]:
comparison = state_days.merge(state_sales_price,on=['State','Year'], how='outer')

In [13]:
comparison

                    State  Year  value_x   value_y
0              California  2010    108.0  265600.0
1                   Texas  2010    121.0  139900.0
2                New York  2010    188.0       NaN
3                 Florida  2010    161.0  128800.0
4                Illinois  2010    174.0  161900.0
..                    ...   ...      ...       ...
602          South Dakota  2009      NaN  125100.0
603  District of Columbia  2009      NaN  356600.0
604               Wyoming  2009      NaN  182900.0
605          South Dakota  2010      NaN  125000.0
606          South Dakota  2011      NaN  129200.0

[607 rows x 4 columns]

In [14]:
comparison = comparison.dropna()

In [15]:
comparison.columns = ['State', 'Year', 'Days','Price']

In [16]:
state_day_group = comparison.groupby('State')['Days'].mean()
state_price_group = comparison.groupby('State')['Price'].mean()
year_day_group = comparison.groupby('Year')['Days'].mean()
year_price_group = comparison.groupby('Year')['Price'].mean()

In [32]:
# state_day_group

In [33]:
# state_price_group

In [19]:
year_day_group

Year
2010    139.151163
2011    131.340909
2012    133.544444
2013    124.777778
2014    115.388889
2015    115.400000
2016    112.944444
2017    105.717391
2018     96.163265
2019     96.285714
2020     94.265306
Name: Days, dtype: float64

In [20]:
year_price_group

Year
2010    169381.395349
2011    167904.545455
2012    160533.333333
2013    174726.666667
2014    184815.555556
2015    193808.888889
2016    202468.888889
2017    212228.260870
2018    224234.693878
2019    235697.959184
2020    254275.510204
Name: Price, dtype: float64

In [21]:
comparison['score'] = comparison['Price'] / comparison['Days']

C:\Users\joshf\AppData\Local\Temp/ipykernel_21708/1212967638.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  comparison['score'] = comparison['Price'] / comparison['Days']

In [22]:
comparison.to_csv('Datasets/House Price/Comparison_Scores.csv')

In [23]:
comparison_s_avg = comparison.groupby('State')['score'].mean()

In [24]:
cdf = comparison_s_avg.to_frame()

Similar to how I selected by tiers before, I'll take a mean of the highest and lowest scorers, tally the apeparances of each, and create three tier lists.

In [25]:
high_tier = cdf.nlargest(10,'score')

In [26]:
high_tier

                            score
State
District of Columbia  5260.328169
Hawaii                4596.865009
California            4364.519389
Colorado              3172.862798
Washington            2918.754194
Massachusetts         2912.259636
New Hampshire         2771.812637
Rhode Island          2604.129777
Utah                  2511.146071
Oregon                2461.220252

In [27]:
low_tier = cdf.nsmallest(10,'score')

In [28]:
low_tier

                      score
State
West Virginia    924.398069
Michigan         984.203705
Alabama         1029.181300
Ohio            1065.316458
Arkansas        1082.949055
Oklahoma        1145.258044
Iowa            1151.617972
Indiana         1172.683595
South Carolina  1207.856505
Pennsylvania    1229.144836

In [29]:
mid_tier = cdf.nsmallest(30,'score').nlargest(10,'score')# get smallest 30, then get 20-30

In [30]:
mid_tier

                    score
State
New Jersey    1802.070354
South Dakota  1748.516081
Minnesota     1739.636824
Delaware      1738.469207
North Dakota  1701.421187
Connecticut   1677.921519
Kansas        1618.809391
New York      1614.801435
Nebraska      1569.346548
Florida       1567.373068

In [31]:
low_tier.to_csv('Datasets/House Price/low_tier_scorers.csv')
mid_tier.to_csv('Datasets/House Price/mid_tier_scorers.csv')
high_tier.to_csv('Datasets/House Price/high_tier_scorers.csv')